app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist_id", "song_album_cover_file_name", "song_album_cover_content_type", "song_album_cover_file_size", "song_album_cover_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @song = Song.new(song_params)

    if @song.save